% 运动学参数
l1 = 73.5/1000; % 连杆 1 长度 (m)
l2 = 250/1000; % 连杆 2 长度 (m)
l3 = 350/1000; % 连杆 3 长度 (m)

% 质量和惯量参数
m1 = 0.35860380842039224; % 连杆 1 质量 (kg)
m2 = 0.41832879929919531; % 连杆 2 质量 (kg)
m3 = 0.30868160098056913; % 连杆 3 质量 (kg)

r1 = [l1/2 0 0]; % 连杆 1 质心位置 (m)
r2 = [l2/2 0 0]; % 连杆 2 质心位置 (m)
r3 = [l3/2 0 0]; % 连杆 3 质心位置 (m)

I1 = [403.0625837954662 0 0; 0 445.44215127068657 0; 0 0 392.21807910087716]/1000000; % 连杆 1 惯性矩 (kg*m^2)
I2 = [3054.7894949519637 0 0; 0 2967.651878393533 0; 0 0 134.33960592174606]/1000000; % 连杆 2 惯性矩 (kg*m^2)
I3 = [3359.5698332293568 0 0; 0 61.728271798992239 0; 0 0 3332.0843992854284]/1000000; % 连杆 3 惯性矩 (kg*m^2)

% 创建机械臂连杆
% L1 = Link('revolute','d', 0, 'a', l1, 'alpha', -pi/2, 'modified', 'offset', 97.661581997810416);
% L2 = Link('revolute','d', 0, 'a', l2, 'alpha', 0, 'modified', 'offset', -89.473812640630314);
% L3 = Link('revolute','d', 0, 'a', l3, 'alpha', 0, 'modified', 'offset', 91.345607359572639);
% 创建机械臂连杆
L1 = Link('revolute','d', l1, 'a', 0, 'alpha', 0, 'offset', 97.661581997810416);
L2 = Link('revolute','d', 0, 'a', l2, 'alpha', -pi/2, 'offset', -89.473812640630314);
L3 = Link('revolute','d', 0, 'a', l3, 'alpha', 0, 'offset',  91.345607359572639);

L1.m = m1;
L1.r = r1;
L1.I = I1;
L2.m = m2;
L2.r = r2;
L2.I = I2;
L3.m = m3;
L3.r = r3;
L3.I = I3;

% 创建机器人模型
robot_new = SerialLink([L1 L2 L3]);

% 显示机器人模型
robot_new.teach;